// lib/services/news_service.dart
import 'package:flood_survival_app/models/news_model.dart';

class NewsService {
  static List<NewsItem> getAllNews() {
    return [
      NewsItem(
        id: '1',
        title: 'สุโขทัยน้ำท่วมสวรรคโลกวิกฤติ',
        description:
            'พนังกั้นน้ำแตก น้ำไหลทะลักเข้าท่วมหลายชุมชน ชาวบ้านเดือดร้อนหนัก',
        content:
            'สถานการณ์น้ำท่วมในจังหวัดสุโขทัยยังคงวิกฤติ โดยเฉพาะที่อำเภอสวรรคโลก มวลน้ำในแม่น้ำยมเพิ่มสูงขึ้นอย่างต่อเนื่อง ทำให้พนังกันน้ำที่ริมแม่น้ำยม ม.6 ต.ท่าทอง พังทลายไป ซึ่งเป็นเหตุให้บ้านเรือนประชาชนกว่า 100 ครัวเรือนได้รับผลกระทบ น้ำทะลักเข้าท่วมพื้นที่อย่างรวดเร็วพนังปูนที่พังทลายนั้นมีความยาวกว่า 20 เมตร หลังจากที่น้ำได้มุดลอดใต้กำแพงแล้วกัดเซาะจนทำให้พนังขาดเป็นช่องทางให้น้ำไหลบ่าเข้าท่วมบ้านเรือน ชาวบ้านบางรายต้องหนีขึ้นไปอาศัยที่วัดหนองป่าตอ โดยทาง อบต. ได้จัดตั้งศูนย์ช่วยเหลือผู้ประสบภัยชั่วคราวที่วัดดังกล่าวนางเปลือย คำวัฒนา ชาวบ้านในพื้นที่ที่ได้รับผลกระทบ กล่าวว่า สถานการณ์น้ำท่วมครั้งนี้ถือว่ารุนแรงกว่าปี 54 ซึ่งน้ำท่วมครั้งนั้นยังไม่ถึงขนาดนี้ โดยบางจุดที่เคยใช้กระสอบทรายกั้นน้ำยังสามารถป้องกันได้ แต่ครั้งนี้น้ำมาแรงจนไม่สามารถรับมือได้.การช่วยเหลือและการฟื้นฟูในพื้นที่ยังคงดำเนินการต่อไป เพื่อบรรเทาความเดือดร้อนของประชาชนในพื้นที่.',
        imageUrl: 'assets/images/news3.png',
        date: 'วันนี้ 16:00 น.',
        urgency: NewsUrgency.high,
        category: 'ข่าวล่าสุด',
        location: 'จังหวัดสุโขทัย',
      ),
      NewsItem(
        id: '2',
        title: 'เมืองชลฝนตกหนัก น้ำท่วมขัง จราจรติดขัด',
        description:
            'ฝนถล่มเมืองชล! น้ำท่วม ถ.สุขุมวิท รถตู้เครื่องดับทำติดยาวหลาย กม.',
        content:
            '''ฝนถล่มเมืองชล! น้ำท่วมถนนสุขุมวิท รถตู้เครื่องดับทำติดยาวหลายกิโลเมตร

เมื่อเวลา 12.00 น. ของวันนี้ ฝนได้ตกกระหน่ำในเขตอำเภอเมืองชลบุรี ส่งผลให้น้ำไม่สามารถระบายลงทะเลทัน ทำให้เกิดน้ำท่วมถนนสุขุมวิท ซึ่งเป็นเส้นทางหลักที่เชื่อมต่อระหว่างตัวเมืองชลบุรีไปยังบางแสนและพัทยา

พื้นที่ที่ได้รับผลกระทบ:

•บริเวณสี่แยกโรงเรียนชลราษฎรอำรุง (หมู่ 3 ต.บ้านสวน) ซึ่งมักจะท่วมทุกครั้งที่ฝนตกหนัก น้ำท่วมในระดับสูงถึง 70 เซนติเมตร บางจุดท่วมมิดล้อรถยนต์

•รถตู้โดยสารที่วิ่งระหว่างชลบุรี-อนุสาวรีย์ชัยสมรภูมิ เครื่องดับกลางถนน ทำให้ผู้โดยสารไม่สามารถลงจากรถได้ และเกิดการติดขัดยาวหลายกิโลเมตร
ผลกระทบในพื้นที่ใกล้เคียง:

•ถนนตามตรอกซอกซอยและหมู่บ้านหลายแห่งบริเวณใกล้เคียงน้ำทะลักไหลจากฝั่งภูเขาท่วมถนน เอ่อล้นเข้าบ้านเรือนประชาชนเป็นจำนวนมาก
เส้นทางที่ยังสามารถสัญจรได้:

•ถนนวชิรปราการ, ถนนใจกลางเมือง, และ ถนนพระยาสัจจา ซึ่งเป็นเส้นทางไปยังตลาดอ่างศิลาและบางแสน ยังสามารถสัญจรได้ตามปกติ ไม่มีน้ำท่วม''',
        imageUrl: 'assets/images/news1.png',
        date: 'วันนี้ 12:00 น.',
        urgency: NewsUrgency.medium,
        category: 'ข่าวล่าสุด',
        location: 'จังหวัดชลบุรี',
      ),
      NewsItem(
        id: '3',
        title: 'เสริมคันดินแม่น้ำยม จ.พิษณุโลก',
        description:
            'เจ้าหน้าที่เร่งเสริมคันดินกั้นแม่น้ำยม เตรียมรับมวลน้ำจากสุโขทัย',
        content:
            '  เจ้าหน้าที่ชลประทานในจังหวัดพิษณุโลกกำลังเร่งเสริมคันดินกั้นแม่น้ำยม เพื่อเตรียมรับมวลน้ำจากจังหวัดสุโขทัยที่อาจไหลมาสมทบ สถานการณ์น้ำท่วมในพื้นที่เริ่มส่งผลกระทบต่อชุมชน โดยเฉพาะในอำเภอพรหมพิราม ที่น้ำหลากเข้าท่วมถนนทางเข้าหมู่บ้านคลองวังมะขาม และมีความเสี่ยงที่ระดับน้ำจะเพิ่มขึ้นต่อเนื่อง ชาวบ้านในพื้นที่ได้เตรียมกระสอบทรายเพื่อป้องกันบ้านเรือนแล้ว ขณะเดียวกันเจ้าหน้าที่ก็ได้เสริมคันดินกั้นน้ำในบางพื้นที่ โดยเฉพาะบริเวณประตูระบายน้ำบ้านใหม่โพธิ์ทอง ซึ่งเป็นจุดที่น้ำจากสุโขทัยจะไหลเข้าสู่แม่น้ำยมสายเก่า การปฏิบัติงานของเจ้าหน้าที่ได้รับความสนใจจากชาวบ้านที่มาปักหลักติดตามสถานการณ์ด้วยความกังวล การเสริมคันดินยังคงดำเนินการอย่างต่อเนื่อง และชาวบ้านบางส่วนยังคงไม่มั่นใจว่าระดับน้ำจะเพิ่มขึ้นมากน้อยเพียงใด ขณะที่เจ้าหน้าที่ได้เตรียมการรับมือสถานการณ์น้ำท่วมอย่างเต็มที่และยังคงติดตามสถานการณ์อย่างใกล้ชิด.',
        imageUrl: 'assets/images/news5.png',
        date: 'วันนี้ 14:15 น.',
        urgency: NewsUrgency.low,
        category: 'ข่าวล่าสุด',
        location: 'จังหวัดพิษณุโลก',
      ),
      NewsItem(
        id: '4',
        title: 'เตือนภัยฉบับที่ 6: พายุฝนฟ้าคะนอง',
        description: 'กรมอุตุฯ เตือนพายุฝนฟ้าคะนองถล่มวันแรก กระทบ 11 จังหวัด',
        content:
            '''กรมอุตุนิยมวิทยาประกาศเตือนเกี่ยวกับอากาศแปรปรวนที่จะเกิดขึ้นในประเทศไทยตอนบน โดยมีพายุฝนฟ้าคะนอง ฟ้าผ่า ลมกระโชกแรง และอาจมีลูกเห็บตกบางแห่งในภาคเหนือและภาคตะวันออกเฉียงเหนือในระยะแรก หลังจากนั้นอุณหภูมิจะลดลง

พื้นที่ที่ได้รับผลกระทบ:

• ภาคเหนือ: ฝนฟ้าคะนองและลมกระโชกแรงบางแห่ง
• ภาคตะวันออกเฉียงเหนือ: ฝนฟ้าคะนองในหลายพื้นที่ พร้อมลูกเห็บบางแห่ง
• ภาคกลาง และกรุงเทพมหานคร: ฝนฟ้าคะนองและลมแรง
• ภาคตะวันออก: ฝนฟ้าคะนอง
• ภาคใต้: ฝนเพิ่มขึ้นอย่างมาก โดยฝนจะตกหนักบางพื้นที่ และอาจเกิดน้ำท่วมฉับพลันและน้ำป่าไหลหลาก

สำหรับบริเวณ อ่าวไทยตอนล่าง คลื่นลมจะมีกำลังค่อนข้างแรง โดยมีคลื่นสูง 2-3 เมตร และบริเวณที่มีฝนฟ้าคะนองจะมีคลื่นสูงมากกว่า 3 เมตร ขอให้ชาวเรือระมัดระวังการเดินเรือ และหลีกเลี่ยงการเดินเรือในบริเวณที่มีฝนฟ้าคะนอง
ประชาชนในพื้นที่ที่ได้รับผลกระทบควรติดตามข้อมูลจากกรมอุตุนิยมวิทยาและหลีกเลี่ยงการเดินทางผ่านพื้นที่เสี่ยง พร้อมเสริมความแข็งแรงให้กับสิ่งปลูกสร้าง และป้องกันความเสียหายทางการเกษตร.

ข้อมูลเพิ่มเติม:

• เว็บไซต์กรมอุตุนิยมวิทยา www.tmd.go.th
• สายด่วน 1182 และ 0-2399-4012-13''',
        imageUrl: 'assets/images/news2.png',
        date: 'วันนี้ 09:30 น.',
        urgency: NewsUrgency.medium,
        category: 'ข่าวล่าสุด',
        location: 'ทั่วประเทศ',
      ),
      NewsItem(
        id: '5',
        title: 'เตือน 43 จังหวัด ระวังพายุฤดูร้อน',
        description:
            'เหนือ ภาคกลาง กรุงเทพฯ ปริมณฑล ภาคตะวันออก และภาคใต้ ฝนฟ้าคะนอง ลมกระโชก ฟ้าผ่า เตือน 43 จังหวัด ระวังอันตรายจากพายุฤดูร้อน ',
        content:
            'กรมอุตุนิยมวิทยาพยากรณ์อากาศ 24 ชั่วโมงข้างหน้า สำหรับภาคเหนือ, ภาคกลาง, กรุงเทพมหานคร, ภาคตะวันออก และภาคใต้ตอนบน จะมีพายุฤดูร้อนเกิดขึ้น โดยมีฝนฟ้าคะนอง ลมกระโชกแรง และอาจมีฟ้าผ่าในบางพื้นที่ หลังจากนั้นอากาศจะคลายความร้อนลง ขอให้ประชาชนระมัดระวังอันตรายจากพายุฤดูร้อน และหลีกเลี่ยงการเดินทางในพื้นที่ที่มีฝนฟ้าคะนองหรือที่โล่งแจ้งใต้ต้นไม้ใหญ่และสิ่งปลูกสร้างที่ไม่แข็งแรงส่วนภาคใต้มีฝนฟ้าคะนองบางแห่ง และคลื่นลมในทะเลอ่าวไทยและอันดามันมีความสูง 1-2 เมตร โดยชาวเรือควรระมัดระวังการเดินเรือในพื้นที่ที่มีฝนฟ้าคะนองสำหรับฝุ่นละอองในภาคเหนืออยู่ในเกณฑ์ปานกลางถึงค่อนข้างมาก ส่วนภาคตะวันออกเฉียงเหนือ, ภาคกลาง และภาคตะวันออกมีฝนตกในบางพื้นที่ ทำให้การสะสมฝุ่นละอองลดลงพยากรณ์อากาศ: ฝนฟ้าคะนอง 20-60% ของพื้นที่ในหลายภาค อุณหภูมิ 15-38°C.',
        imageUrl: 'assets/images/news4.png',
        date: 'วันนี้ 13:00 น.',
        urgency: NewsUrgency.medium,
        category: 'ข่าวล่าสุด',
        location: 'ทั่วประเทศ',
      ),

      //---------------------------------------------------------------------------

      NewsItem(
        id: '6',
        title: 'น้ำท่วมทำท่องเที่ยวเชียงใหม่สูญกว่า 2.2 พันล้าน',
        description:
            'สภาอุตสาหกรรมท่องเที่ยวแนะรัฐจัดมาตรการชุดสอง กระตุ้นไฮซีซั่น',
        content:
            '''วันที่ 16 ตุลาคม 2567 – รายงานระบุว่า อุทกภัยสองระลอกที่เกิดขึ้นในช่วงปลายเดือนกันยายนถึงต้นเดือนตุลาคมที่ผ่านมา ได้สร้างความเสียหายอย่างหนักต่ออุตสาหกรรมการท่องเที่ยวของเชียงใหม่

นายพัลลภ แซ่จิว รักษาการประธานสภาอุตสาหกรรมท่องเที่ยวจังหวัดเชียงใหม่ ประเมินความเสียหายจากน้ำท่วมทั้งสองระลอกว่าอยู่ที่กว่า 2,280 ล้านบาท โดยผลกระทบหลักเกิดจากนักท่องเที่ยวชาวไทยที่ลดลงอย่างชัดเจนในช่วง 10 วันที่เกิดน้ำท่วม ทำให้โรงแรม ร้านอาหาร และกิจกรรมท่องเที่ยวต้องหยุดชะงัก นอกจากนี้ ยังมีความเสียหายต่อยานพาหนะสำหรับการท่องเที่ยว เช่น รถบัส รถตู้ รวมถึงอุปกรณ์เครื่องมือต่าง ๆ

ไฮซีซั่นที่กำลังมาถึง กับความหวังจากภาครัฐ
ในช่วงฤดูกาลท่องเที่ยวหรือไฮซีซั่นที่กำลังจะมาถึง แม้นักท่องเที่ยวต่างชาติจากจีน เกาหลี อเมริกา และยุโรป ซึ่งคิดเป็น 30% ของนักท่องเที่ยวทั้งหมด ยังมีการเดินทางตามปกติ แต่นักท่องเที่ยวไทย ซึ่งมีสัดส่วนถึง 70% อาจลดลง โดยเฉพาะกลุ่มที่นิยมเที่ยวธรรมชาติ เช่น ปางช้าง ล่องแพ และท่องเที่ยวเชิงผจญภัย

แคมเปญ "แอ่วเหนือคนละครึ่ง" อาจไม่เพียงพอ
นายพัลลภให้ความเห็นว่า มาตรการช่วยเหลือของภาครัฐ เช่น "แอ่วเหนือคนละครึ่ง" ที่ช่วยจ่ายคนละ 400 บาท อาจไม่เพียงพอในการกระตุ้นการท่องเที่ยว เนื่องจากโดยเฉลี่ย นักท่องเที่ยวไทยใช้จ่ายวันละ 2,000 บาท หรือประมาณ 5,000 บาทต่อทริป

เขาคาดหวังว่ารัฐบาลจะสนับสนุนเงินช่วยเหลือ 2,000 บาทต่อคน ซึ่งเป็นตัวเลขที่เหมาะสมมากกว่า อย่างไรก็ตาม หากมาตรการดังกล่าวเป็นเพียงโครงการนำร่องเพื่อสร้างความมั่นใจให้นักท่องเที่ยวว่าเชียงใหม่ยังเที่ยวได้ ก็คาดหวังว่า จะมีแคมเปญกระตุ้นเศรษฐกิจชุดที่สองตามมาในอนาคต''',
        imageUrl: 'assets/images/news6.png',
        date: 'วันที่ 16 ตุลาคม 2567',
        urgency: NewsUrgency.low,
        category: 'ผลกระทบน้ำท่วม',
        location: 'จังหวัดเชียงใหม่',
      ),

      NewsItem(
        id: '7',
        title: 'กระทบ “น้ำท่วม-น้ำมันแพง-ค่าแรงสูง”',
        description: 'ราคาวัสดุก่อสร้างเดือน ต.ค.ขึ้นยกแผง',
        content:
            '''นายพูนพงษ์ นัยนาภากรณ์ ผู้อำนวยการสำนักงานนโยบายและยุทธศาสตร์การค้า (สนค.) เปิดเผยถึงสถานการณ์ในปัจจุบัน

ดัชนีราคาวัสดุก่อสร้างในเดือน ตุลาคม 2565 อยู่ที่ 119.6 เพิ่มขึ้น 3.6% เมื่อเทียบกับเดือน ตุลาคม 2564 แต่ลดลงจากเดือน กันยายน 2565 ซึ่งสูงถึง 5.2% โดยการลดลงนี้เกิดจากการชะลอตัวของราคาวัสดุก่อสร้างบางประเภท เช่น เหล็ก, ซีเมนต์, ผลิตภัณฑ์คอนกรีต และวัสดุก่อสร้างอื่น ๆ

สาเหตุของการชะลอราคาวัสดุก่อสร้าง เกิดจากหลายปัจจัย เช่น น้ำท่วม สภาพอากาศ และราคาพลังงานที่สูงขึ้น ซึ่งส่งผลให้ราคาวัสดุที่เกี่ยวข้องมีการปรับตัวเพิ่มขึ้นตาม

การจำแนกรายหมวดวัสดุก่อสร้าง
•ไม้และผลิตภัณฑ์ไม้ เพิ่มขึ้น 8.1%
•ซีเมนต์ เพิ่มขึ้น 6.9%
• เพิ่มขึ้น 3.8%
•เหล็กและผลิตภัณฑ์เหล็ก เพิ่มขึ้น 1.3%
•กระเบื้อง เพิ่มขึ้น 4.4%
•วัสดุฉาบผิว เพิ่มขึ้น 2.5%
•สุขภัณฑ์ เพิ่มขึ้น 0.7%

ปัจจัยที่ส่งผลต่อการปรับตัวของดัชนีวัสดุก่อสร้าง
นายพูนพงษ์กล่าวว่า สภาพภูมิอากาศและปัญหาน้ำท่วม ส่งผลให้วัตถุดิบบางประเภทขาดแคลนและราคานำเข้าสูงขึ้น รวมถึงการปรับขึ้นของราคาพลังงานที่ทำให้ต้นทุนการผลิตสูงขึ้น นอกจากนี้ การปรับขึ้นของค่าจ้างแรงงานก็เป็นปัจจัยสำคัญที่กดดันต้นทุนการผลิต

เมื่อเทียบกับเดือนก่อนหน้า ดัชนีราคาวัสดุก่อสร้างสูงขึ้นเพียง 0.1% โดยหมวดเหล็กและผลิตภัณฑ์เหล็ก และอุปกรณ์ไฟฟ้าและประปาเป็นกลุ่มสินค้าที่ราคาปรับตัวสูงขึ้นมากที่สุด เนื่องจากผลกระทบจากราคาพลังงานและต้นทุนวัตถุดิบ เช่น เหล็ก น้ำมัน และถ่านหิน

แนวโน้มในเดือน พฤศจิกายน 2565
นายพูนพงษ์กล่าวถึงแนวโน้มในเดือน พฤศจิกายน 2565 ว่า คาดว่าดัชนีราคาวัสดุก่อสร้างจะขยายตัวใกล้เคียงกับเดือน ตุลาคม 2565 เนื่องจากราคาพลังงานที่ยังคงสูง และการอ่อนค่าของเงินบาท รวมถึงการปรับขึ้นค่าแรง ส่งผลให้ต้นทุนวัตถุดิบ ต้นทุนการผลิต และค่าขนส่งยังอยู่ในระดับสูง

ความต้องการในประเทศ มีแนวโน้มดีขึ้นตามการฟื้นตัวของเศรษฐกิจและการท่องเที่ยว ซึ่งจะช่วยผลักดันให้ดัชนีราคาวัสดุก่อสร้างขยายตัว ขณะที่การชะลอของเศรษฐกิจในประเทศสำคัญส่งผลให้ความต้องการเหล็กและผลิตภัณฑ์เหล็กลดลง''',
        imageUrl: 'assets/images/news7.png',
        date: 'วันที่ 9 พฤษจิกายน 2565',
        urgency: NewsUrgency.medium,
        category: 'ผลกระทบน้ำท่วม',
        location: 'ทั่วประเทศ',
      ),

      NewsItem(
        id: '8',
        title: 'น้ำท่วมทุบเศรษฐกิจเสียหาย 6 พันล้าน',
        description: 'หอการค้าแนะรัฐเตรียมแผนรับมือลดความเสียหายประชาชน',
        content:
            '''นายสนั่น อังอุบลกุล ประธานกรรมการหอการค้าไทยและสภาหอการค้าแห่งประเทศไทย เปิดเผยถึงผลกระทบจากสถานการณ์น้ำท่วมในภาคเหนือ 9 จังหวัด ได้แก่ เชียงราย, พะเยา, สุโขทัย, ลำปาง, เพชรบูรณ์, แพร่, น่าน, พิษณุโลก และนครสวรรค์ โดย หอการค้าไทยและมหาวิทยาลัยหอการค้าไทย ประเมินมูลค่าความเสียหายเบื้องต้นอยู่ที่ 4,000-6,000 ล้านบาท หรือประมาณ 0.02-0.03% ของ ผลิตภัณฑ์มวลรวมในประเทศ (จีดีพี)

ความเสียหายจากน้ำท่วม
ความเสียหายส่วนใหญ่เกิดกับ ภาคการเกษตร ตามมาด้วย ภาคบริการ และ ภาคอุตสาหกรรม
หอการค้าไทยเสนอให้รัฐบาลจัดตั้ง ศูนย์บริหารจัดการน้ำส่วนหน้า ในพื้นที่เสี่ยงอุทกภัย โดยมีนายกรัฐมนตรีเป็นประธาน เพื่อให้การสั่งการและมอบหมายนโยบายข้ามกระทรวงและเกิดการบูรณาการการทำงานอย่างคล่องตัว พร้อมเตรียมแผนรับมือมวลน้ำที่จะไหลลงสู่ภาคกลางและกรุงเทพฯ

มาตรการช่วยเหลือจากหอการค้าไทย
หอการค้าไทยร่วมมือกับ บริษัทรายใหญ่ เช่น กลุ่มค้าปลีกและค้าส่ง เพื่อจัดแคมเปญลดราคาสินค้าอุปโภคบริโภค เครื่องใช้ไฟฟ้า และวัสดุก่อสร้าง เช่น

ไทวัสดุ ลดราคาสินค้ากลุ่มวัสดุก่อสร้างที่เกี่ยวข้องกับการซ่อมแซมบ้าน
กลุ่มอุปโภคบริโภค ลดราคาสินค้าจำเป็นกว่า 16,000 รายการ เช่น ข้าวสาร ไข่ไก่ ยาสระผม ฯลฯ
โตโยต้า และ เอสซีจี ให้ส่วนลดในการซ่อมแซมยานพาหนะและวัสดุก่อสร้าง
หอการค้าไทยยังได้ประสานกับ ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อม และ ธนาคารเพื่อการส่งออกและนำเข้า เพื่อออกมาตรการช่วยเหลือทางการเงินสำหรับผู้ที่ได้รับผลกระทบ

กรมส่งเสริมการเกษตรเตรียมช่วยเหลือเกษตรกร
นายพีรพันธ์ คอทอง อธิบดีกรมส่งเสริมการเกษตร กล่าวว่า ภาคการเกษตรได้รับผลกระทบใน 33 จังหวัด โดยเฉพาะพื้นที่ลาดเชิงเขาและลุ่มน้ำ กรมฯ ได้จัดชุดเฉพาะกิจเพื่อช่วยเหลือเกษตรกรที่ได้รับผลกระทบตามระเบียบของกระทรวงการคลัง โดยมีการช่วยเหลือทั้งด้านการฟื้นฟูพืชผลและพื้นที่การเกษตร

การฟื้นฟูการท่องเที่ยว
นายเสริมศักดิ์ พงษ์พานิช รมว.การท่องเที่ยวและกีฬา กล่าวว่า จังหวัด น่าน และจังหวัดใกล้เคียงที่ได้รับผลกระทบจากน้ำท่วม เช่น เชียงราย, แพร่, และ เชียงใหม่ ได้คลี่คลายลงแล้วและสถานที่ท่องเที่ยวสามารถเปิดให้บริการได้ตามปกติ หัวหน้าส่วนราชการในพื้นที่เร่งประชาสัมพันธ์เพื่อดึงดูดนักท่องเที่ยวกลับมา''',
        imageUrl: 'assets/images/news8.png',
        date: 'วันที่ 30 สิงหาคม 2567',
        urgency: NewsUrgency.high,
        category: 'ผลกระทบน้ำท่วม',
        location: 'ภาคเหนือ',
      ),

      //------------------------ช่วยเหลือ ผู้ประสบภัย---------------------------------------------------------

      NewsItem(
        id: '9',
        title: 'ออมสินช่วยเหลือเร่งด่วนผู้ประสบภัยน้ำท่วม 3 จังหวัดชายแดนใต้',
        description: 'เตรียมออกมาตรการระยะยาวฟื้นฟูและเยียวยาหลังวิกฤตผ่านพ้น',
        content:
            '''นายวิทัย รัตนากร ผู้อำนวยการธนาคารออมสิน เปิดเผยว่า จากสถานการณ์ภัยพิบัติน้ำท่วมใน 3 จังหวัดชายแดนภาคใต้ ได้แก่ ยะลา ปัตตานี และนราธิวาส ซึ่งมีพื้นที่ความเสียหายกว่า 90,000 ไร่ ธนาคารออมสินได้ให้ความช่วยเหลือเร่งด่วนเพื่อบรรเทาความเดือดร้อนเฉพาะหน้า โดยมอบสิ่งของช่วยเหลือเบื้องต้นมูลค่ารวม 2,000,000 บาท ได้แก่:

•ถุงยังชีพ 2,000 ชุด
•เครื่องอุปโภคบริโภค เช่น ข้าวสาร น้ำดื่ม เครื่องนอน เครื่องนุ่งห่ม พัดลม
ธนาคารยังได้จัดหาอาหาร 3 มื้อให้แก่ผู้ประสบภัย โดยการมอบความช่วยเหลือครั้งนี้มีผู้รับมอบจากรัฐมนตรีช่วยว่าการกระทรวงมหาดไทย และผู้ว่าราชการจังหวัดต่างๆ

ธนาคารออมสินยังได้ลงพื้นที่ประเมินสถานการณ์และเตรียมมาตรการช่วยเหลือระยะยาว เช่น การให้สินเชื่อเงื่อนไขพิเศษสำหรับผู้ประสบภัย เพื่อฟื้นฟูบ้านเรือนและสภาพความเป็นอยู่หลังจากน้ำลด

ติดต่อธนาคารออมสิน: ประชาชนในพื้นที่สามารถติดต่อธนาคารออมสินสาขาใกล้เคียง หรือ GSB Contact Center โทร. 1115 สำหรับคำปรึกษาด้านแหล่งเงินช่วยเหลือ.''',
        imageUrl: 'assets/images/news9.png',
        date: 'วันที่ 29 ธันวาคม 2566',
        urgency: NewsUrgency.low,
        category: 'การช่วยเหลือ',
        location: '3 จังหวัดชายแดนใต้',
      ),

      NewsItem(
        id: '10',
        title:
            'ครม. เร่งมาตรการช่วยเหลือเยียวยาผู้ประสบอุทกภัยทุกมิติ แบ่งเบาภาระ ฟื้นฟู และเสริมสภาพคล่อง',
        description: 'มาตรการช่วยเหลือผู้ประสบภัยน้ำท่วมจากรัฐบาล',
        content:
            '''ในวันที่ 15 ตุลาคม 2567, นายกรัฐมนตรีนางสาวแพทองธาร ชินวัตร สั่งการในที่ประชุมคณะรัฐมนตรี (ครม.) เพื่อดำเนินมาตรการเยียวยาผู้ประสบภัยน้ำท่วมในหลายด้าน เช่น การช่วยฟื้นฟู การแบ่งเบาภาระค่าใช้จ่าย และการเสริมสภาพคล่องทางการเงินสำหรับการฟื้นฟูกิจการที่ได้รับผลกระทบ

มาตรการช่วยเหลือในด้านต่าง ๆ ได้แก่:

1. มาตรการลดภาษีและค่าใช้จ่าย
•ยกเว้นภาษีเงินได้ ทั้งบุคคลธรรมดาและนิติบุคคลจากเงินชดเชยที่ได้รับจากรัฐบาลและบริษัทประกัน
•ลดค่าเช่า ที่ราชพัสดุจากกรมธนารักษ์
    •ลดค่าเช่า 1 ปีสำหรับที่พักเสียหายบางส่วน และ 2 ปีหากเสียหายทั้งหลัง
    •ลดค่าเช่าสำหรับการเกษตรและกิจการอื่น ๆ ที่ได้รับผลกระทบ

2. สินเชื่อฟื้นฟูและเสริมสภาพคล่อง
•โครงการ Soft Loan วงเงิน 50,000 ล้านบาท สำหรับ SMEs ที่ได้รับผลกระทบจากน้ำท่วม โดยคิดอัตราดอกเบี้ยไม่เกิน 3.5% ต่อปี
•โครงการ SMEs No One Left Behind ค้ำประกันสินเชื่อ 1,000 ล้านบาท
•ธนาคารออมสิน พักชำระหนี้ 6 เดือนสำหรับสินเชื่อไม่เกิน 10 ล้านบาท
•สินเชื่อเพื่อการซ่อมแซมบ้าน และ สินเชื่อฟื้นฟูการเกษตร อัตราดอกเบี้ยต่ำและวงเงินสูงสุด 500,000 บาท

3. มาตรการการช่วยเหลือการฟื้นฟูกิจการ
•ธนาคารเพื่อการส่งออกและนำเข้า ขยายระยะเวลาตั๋วสัญญาใช้เงินสูงสุด 180 วัน
•ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อม (SME Bank) ให้วงเงินเพิ่ม 10% สำหรับธุรกิจในพื้นที่น้ำท่วม

4. การช่วยเหลือเงินเยียวยา
•เงินเยียวยาผู้ประสบภัยในฤดูฝน ปี 2567 ครัวเรือนละ 9,000 บาท
•ค่าล้างดินโคลน สำหรับที่อยู่อาศัยหลังละ 10,000 บาท

5. การให้บริการในด้านสาธารณูปโภค
•ยกเว้นค่าน้ำประปาและค่าไฟฟ้า สำหรับทำความสะอาดบ้านเรือนประชาชน

มาตรการที่กำลังพิจารณาเพิ่มเติม:
•ลดหย่อนภาษีสำหรับการซื้อวัสดุก่อสร้างในพื้นที่น้ำท่วม
•ขยายระยะเวลาการยื่นภาษีและการยกเว้นอากรขาเข้าเครื่องจักร
•สินเชื่อ Soft Loan เพิ่มเติมอีก 50,000 ล้านบาทสำหรับผู้ประกอบการภาคการท่องเที่ยวและบริการ

เร่งดำเนินการ:
•นายกรัฐมนตรีได้กำชับให้เร่งจ่ายเงินเยียวยาให้เสร็จภายในเดือนตุลาคมนี้.''',
        imageUrl: 'assets/images/news10.png',
        date: 'วันที่ 15 ตุลาคม 2567',
        urgency: NewsUrgency.low,
        category: 'การช่วยเหลือ',
        location: '57 จังหวัด ทั่วประเทศ',
      ),

      NewsItem(
        id: '11',
        title: 'จังหวัดนราธิวาส เร่งรัดการเยียวยาผู้ประสบอุทกภัย 9,000 บาท',
        description:
            'ส่วนกรณีเป็นผู้ประสบอุทกภัยตามเกณฑ์ที่ยังไม่ลงทะเบียน สามารถลงทะเบียนที่อปท.หรือช่องทางออนไลน์ ไม่เกินวันที่ 15 ม.ค.68',
        content:
            '''ข่าวนี้เกี่ยวข้องกับการช่วยเหลือผู้ประสบอุทกภัยในจังหวัดนราธิวาส โดยคณะกรรมการให้ความช่วยเหลือผู้ประสบภัยพิบัติจังหวัดนราธิวาส (ก.ช.ภ.จ.) ได้เร่งพิจารณาอนุมัติความช่วยเหลือให้กับผู้ประสบภัย ซึ่งได้รับการอนุมัติแล้ว 2 ครั้ง โดยครั้งแรกช่วยเหลือ 12,189 ครัวเรือน วงเงิน 109,701,000 บาท และครั้งที่ 2 ช่วยเหลือ 35,818 ครัวเรือน วงเงิน 322,362,000 บาท

ในวันที่ 8 มกราคม 2568 จะมีการโอนเงินเข้าบัญชีพร้อมเพย์ของผู้ประสบภัยโดยตรง ส่วนการพิจารณาอนุมัติรอบที่ 3 จะเกิดขึ้นในวันที่ 9 มกราคม 2568

นอกจากนี้ยังมีการอัปเดตสถานะการลงทะเบียนให้กับผู้ประสบภัย เพื่อให้ผู้ลงทะเบียนทราบสถานะของตัวเอง เช่น "กำหนดการโอนเงิน" หรือ "ปฏิเสธคำขอ" หากสถานะยังค้างเป็น "ยื่นแบบฟอร์ม" แสดงว่าเอกสารยังอยู่ในขั้นตอนการตรวจสอบ ซึ่งหากผู้ลงทะเบียนเห็นว่าตนเองถูกตัดสิทธิ สามารถไปขอคำชี้แจงจากเจ้าหน้าที่ได้

ผู้ที่ต้องการลงทะเบียนเยียวยาน้ำท่วม 9,000 บาท สามารถลงทะเบียนได้ที่ เทศบาลหรือ อบต. หรือทางออนไลน์ที่ ลิงก์นี้ โดยสามารถลงทะเบียนได้จนถึง วันที่ 15 มกราคม 2568 หากสถานะถูกปฏิเสธคำขอ สามารถขอรับคำชี้แจงจากเจ้าหน้าที่เทศบาลหรือ อบต. ได้ หากมีความสงสัยหรือไม่พอใจในคำตัดสิน สามารถร้องทุกข์ผ่านศูนย์ดำรงธรรมได้ค่ะ''',
        imageUrl: 'assets/images/news11.png',
        date: 'วันที่ 6 มกราคม 2568',
        urgency: NewsUrgency.low,
        category: 'การช่วยเหลือ',
        location: 'จังหวัดนราธิวาส',
      ),
    ];
  }

  static List<NewsItem> getNewsByCategory(String category) {
    return getAllNews().where((news) => news.category == category).toList();
  }

  static NewsItem? getNewsById(String id) {
    try {
      return getAllNews().firstWhere((news) => news.id == id);
    } catch (e) {
      return null;
    }
  }
}
